93percentai/esp32-ethernetviawifi/firmware/main/display.c
#include "display.h"

#include <stdarg.h>
#include <stdio.h>
#include <string.h>

#include "board.h"
#include "bridge.h"
#include "driver/gpio.h"
#include "driver/spi_master.h"
#include "esp_idf_version.h"
#include "esp_lcd_panel_io.h"
#include "esp_lcd_panel_ops.h"
#include "esp_lcd_st7735.h"
#include "esp_log.h"
#include "font8x8.h"
#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "hid.h"
#include "httpd_share.h"
#include "net_tether.h"
#include "provisioning.h"
#include "sdcard.h"
#include "sdkconfig.h"
#include "usb_gadget.h"
#include "wifi_mgr.h"

#if CONFIG_BRIDGE_LCD_ENABLED

static const char *TAG = "display";

#define COLOR_BG     0x1082
#define COLOR_PANEL  0x2104
#define COLOR_TEXT   0xEF7D
#define COLOR_MUTED  0x8410
#define COLOR_OK     0x05E0
#define COLOR_WARN   0xFE60
#define COLOR_ERR    0xF800
#define COLOR_ACCENT 0x07FF

static esp_lcd_panel_handle_t s_panel;
static uint16_t s_fb[BOARD_LCD_H_RES * BOARD_LCD_V_RES];
static volatile display_overlay_t s_overlay = DISPLAY_OVERLAY_NONE;
static volatile int s_overlay_seconds;
static volatile display_screen_t s_screen = SCREEN_OVERVIEW;
static volatile bool s_hold_active;
static volatile int s_hold_pct;
static volatile bool s_hold_reset_zone;
static char s_msg1[24];
static char s_msg2[24];
static char s_hold_hint[24];

static uint16_t swap565(uint16_t c)
{
    return (uint16_t)((c >> 8) | (c << 8));
}

static void fb_clear(uint16_t color)
{
    uint16_t c = swap565(color);
    for (int i = 0; i < BOARD_LCD_H_RES * BOARD_LCD_V_RES; i++) {
        s_fb[i] = c;
    }
}

static void fb_fill_rect(int x, int y, int w, int h, uint16_t color)
{
    uint16_t c = swap565(color);
    for (int row = y; row < y + h && row < BOARD_LCD_V_RES; row++) {
        if (row < 0) continue;
        for (int col = x; col < x + w && col < BOARD_LCD_H_RES; col++) {
            if (col < 0) continue;
            s_fb[row * BOARD_LCD_H_RES + col] = c;
        }
    }
}

static void fb_draw_char(int x, int y, char ch, uint16_t fg, uint16_t bg)
{
    if (ch < 32 || ch > 127) ch = '?';
    const uint8_t *glyph = font8x8_basic[(int)ch - 32];
    uint16_t f = swap565(fg);
    uint16_t b = swap565(bg);
    for (int row = 0; row < 8; row++) {
        uint8_t bits = glyph[row];
        int py = y + row;
        if (py < 0 || py >= BOARD_LCD_V_RES) continue;
        for (int col = 0; col < 8; col++) {
            int px = x + col;
            if (px < 0 || px >= BOARD_LCD_H_RES) continue;
            s_fb[py * BOARD_LCD_H_RES + px] = (bits & (1u << col)) ? f : b;
        }
    }
}

static void fb_draw_text(int x, int y, const char *text, uint16_t fg, uint16_t bg)
{
    while (*text) {
        fb_draw_char(x, y, *text++, fg, bg);
        x += 8;
        if (x > BOARD_LCD_H_RES - 8) break;
    }
}

static void fmt_ip(uint32_t addr, char *out, size_t n)
{
    snprintf(out, n, "%u.%u.%u.%u",
             (unsigned)(addr & 0xff), (unsigned)((addr >> 8) & 0xff),
             (unsigned)((addr >> 16) & 0xff), (unsigned)((addr >> 24) & 0xff));
}

/* ---- Common header ---- */
static const char *screen_title(display_screen_t s)
{
    switch (s) {
    case SCREEN_OVERVIEW: return "WIFI BRIDGE";
    case SCREEN_NETWORK:  return "NETWORK";
    case SCREEN_SD:       return "SD CARD";
    case SCREEN_SHARE:    return "FILE SHARE";
    case SCREEN_HID:      return "HID REMOTE";
    default:              return "T-DONGLE";
    }
}

static void draw_header(display_screen_t s)
{
    fb_fill_rect(0, 0, BOARD_LCD_H_RES, 12, COLOR_PANEL);
    fb_draw_text(2, 2, screen_title(s), COLOR_ACCENT, COLOR_PANEL);
    /* screen position dots on the right */
    for (int i = 0; i < SCREEN_COUNT; i++) {
        int x = BOARD_LCD_H_RES - (SCREEN_COUNT - i) * 7;
        fb_fill_rect(x, 4, 4, 4, i == (int)s ? COLOR_ACCENT : COLOR_MUTED);
    }
}

static const char *link_label(wifi_mgr_state_t s)
{
    switch (s) {
    case WIFI_MGR_IDLE: return "NO CONFIG";
    case WIFI_MGR_CONNECTING: return "ASSOC";
    case WIFI_MGR_CONNECTED: return "CONNECTED";
    case WIFI_MGR_DISCONNECTED: return "RECONNECT";
    case WIFI_MGR_NO_AP: return "NO AP";
    case WIFI_MGR_BAD_AUTH: return "BAD AUTH";
    case WIFI_MGR_SCANNING: return "SCANNING";
    case WIFI_MGR_PROVISIONING: return "SETUP AP";
    default: return "?";
    }
}

static uint16_t link_color(wifi_mgr_state_t s)
{
    switch (s) {
    case WIFI_MGR_CONNECTED: return COLOR_OK;
    case WIFI_MGR_CONNECTING:
    case WIFI_MGR_SCANNING:
    case WIFI_MGR_PROVISIONING:
    case WIFI_MGR_DISCONNECTED: return COLOR_WARN;
    case WIFI_MGR_BAD_AUTH:
    case WIFI_MGR_NO_AP: return COLOR_ERR;
    default: return COLOR_MUTED;
    }
}

static void mode_hint(void)
{
    fb_draw_text(2, 70, "hold 2s: toggle", COLOR_MUTED, COLOR_BG);
}

/* ---- Screens ---- */

static void screen_overview(void)
{
    wifi_mgr_status_t st;
    bridge_stats_t stats;
    wifi_mgr_get_status(&st);
    bridge_get_stats(&stats);

    char line[32];
    fb_draw_text(2, 16, "LINK", COLOR_MUTED, COLOR_BG);
    fb_draw_text(42, 16, link_label(st.state), link_color(st.state), COLOR_BG);

    const char *ssid = st.ssid[0] ? st.ssid : "(unset)";
    snprintf(line, sizeof(line), "%.14s", ssid);
    fb_draw_text(2, 28, "SSID", COLOR_MUTED, COLOR_BG);
    fb_draw_text(42, 28, line, COLOR_TEXT, COLOR_BG);

    bool acm = usb_gadget_func_active(USB_FUNC_ACM);
    fb_draw_text(2, 40, "ACM", COLOR_MUTED, COLOR_BG);
    fb_draw_text(42, 40, acm ? "ON" : "OFF",
                 acm ? COLOR_OK : COLOR_MUTED, COLOR_BG);

    char bytes[12], rate[12];
    bridge_format_bytes(stats.bytes_to_host, bytes, sizeof(bytes));
    bridge_format_rate(stats.rate_to_host_bps, rate, sizeof(rate));
    snprintf(line, sizeof(line), "%.10s %.10s", bytes, rate);
    fb_draw_text(2, 52, "DN", COLOR_OK, COLOR_BG);
    fb_draw_text(26, 52, line, COLOR_TEXT, COLOR_BG);

    bridge_format_bytes(stats.bytes_to_wifi, bytes, sizeof(bytes));
    bridge_format_rate(stats.rate_to_wifi_bps, rate, sizeof(rate));
    snprintf(line, sizeof(line), "%.10s %.10s", bytes, rate);
    fb_draw_text(2, 64, "UP", COLOR_WARN, COLOR_BG);
    fb_draw_text(26, 64, line, COLOR_TEXT, COLOR_BG);
}

