93percentai/esp32-ethernetviawifi/firmware/main/display.c
static void screen_network(void)
{
    wifi_mgr_status_t st;
    wifi_mgr_get_status(&st);
    char line[32];

    fb_draw_text(2, 16, "MODE", COLOR_MUTED, COLOR_BG);
    fb_draw_text(42, 16, st.nat_mode ? "NAT TETHER" : "L2 BRIDGE",
                 st.nat_mode ? COLOR_ACCENT : COLOR_OK, COLOR_BG);

    if (st.nat_mode) {
        fb_draw_text(2, 28, "STA", COLOR_MUTED, COLOR_BG);
        if (st.has_ip) {
            fmt_ip(st.sta_ip, line, sizeof(line));
        } else {
            snprintf(line, sizeof(line), "no IP");
        }
        fb_draw_text(34, 28, line, COLOR_TEXT, COLOR_BG);

        esp_netif_ip_info_t usb;
        net_tether_get_usb_ip(&usb);
        fmt_ip(usb.ip.addr, line, sizeof(line));
        fb_draw_text(2, 40, "USB", COLOR_MUTED, COLOR_BG);
        fb_draw_text(34, 40, line, COLOR_TEXT, COLOR_BG);

        fb_draw_text(2, 52, "NAPT", COLOR_MUTED, COLOR_BG);
        fb_draw_text(42, 52, "on", COLOR_OK, COLOR_BG);
    } else {
        fb_draw_text(2, 30, "Host holds the IP", COLOR_TEXT, COLOR_BG);
        fb_draw_text(2, 42, "on the AP subnet.", COLOR_MUTED, COLOR_BG);
        fb_draw_text(2, 54, "ESP has no IP.", COLOR_MUTED, COLOR_BG);
    }
}

static void screen_sd(void)
{
    char line[32];
    if (!sdcard_present()) {
        fb_draw_text(2, 28, "No SD card", COLOR_WARN, COLOR_BG);
        snprintf(line, sizeof(line), "%.18s", sdcard_last_error());
        fb_draw_text(2, 42, line, COLOR_MUTED, COLOR_BG);
        mode_hint();
        return;
    }
    snprintf(line, sizeof(line), "%s %lluMB", sdcard_type_str(),
             (unsigned long long)(sdcard_capacity_bytes() / (1024ULL * 1024ULL)));
    fb_draw_text(2, 16, line, COLOR_TEXT, COLOR_BG);

    bool msc = usb_gadget_func_active(USB_FUNC_MSC);
    fb_draw_text(2, 28, "USB MSC", COLOR_MUTED, COLOR_BG);
    fb_draw_text(66, 28, msc ? "ON" : "OFF", msc ? COLOR_OK : COLOR_MUTED, COLOR_BG);

    const char *own = "idle";
    uint16_t oc = COLOR_MUTED;
    switch (sdcard_owner()) {
    case SD_OWNER_HOST: own = "USB HOST"; oc = COLOR_WARN; break;
    case SD_OWNER_ESP:  own = "WEB/DAV";  oc = COLOR_OK; break;
    default: break;
    }
    fb_draw_text(2, 40, "OWNER", COLOR_MUTED, COLOR_BG);
    fb_draw_text(52, 40, own, oc, COLOR_BG);

    sd_io_stats_t io;
    sdcard_get_io_stats(&io);
    fb_draw_text(2, 52, "IO", COLOR_MUTED, COLOR_BG);
    fb_draw_text(26, 52, io.active ? "ACTIVE" : "idle",
                 io.active ? COLOR_ERR : COLOR_MUTED, COLOR_BG);
    mode_hint();
}

static void screen_share(void)
{
    wifi_mgr_status_t st;
    wifi_mgr_get_status(&st);
    bool on = httpd_share_storage_enabled();

    fb_draw_text(2, 16, "WEB+DAV", COLOR_MUTED, COLOR_BG);
    fb_draw_text(66, 16, on ? "ON" : "OFF", on ? COLOR_OK : COLOR_MUTED, COLOR_BG);

    char line[32];
    if (on && st.has_ip) {
        fb_draw_text(2, 30, "http://", COLOR_MUTED, COLOR_BG);
        fmt_ip(st.sta_ip, line, sizeof(line));
        fb_draw_text(2, 42, line, COLOR_ACCENT, COLOR_BG);
    } else if (on) {
        fb_draw_text(2, 30, "waiting for IP", COLOR_WARN, COLOR_BG);
    } else {
        fb_draw_text(2, 30, "Enable to serve", COLOR_TEXT, COLOR_BG);
        fb_draw_text(2, 42, "SD on the LAN", COLOR_MUTED, COLOR_BG);
    }
    if (sdcard_owner() == SD_OWNER_HOST) {
        fb_draw_text(2, 54, "SD busy (USB)", COLOR_WARN, COLOR_BG);
    }
    mode_hint();
}

static void screen_hid(void)
{
    bool on = usb_gadget_func_active(USB_FUNC_HID);
    fb_draw_text(2, 16, "HID KBD+MOUSE", COLOR_MUTED, COLOR_BG);
    fb_draw_text(2, 28, "STATE", COLOR_MUTED, COLOR_BG);
    fb_draw_text(52, 28, on ? "ON" : "OFF", on ? COLOR_OK : COLOR_MUTED, COLOR_BG);

    if (on) {
        fb_draw_text(2, 40, "HOST", COLOR_MUTED, COLOR_BG);
        fb_draw_text(42, 40, hid_host_ready() ? "READY" : "waiting",
                     hid_host_ready() ? COLOR_OK : COLOR_WARN, COLOR_BG);
        uint32_t ms = hid_ms_since_activity();
        char line[24];
        if (ms == UINT32_MAX) {
            snprintf(line, sizeof(line), "idle");
        } else {
            snprintf(line, sizeof(line), "%lus ago", (unsigned long)(ms / 1000));
        }
        fb_draw_text(2, 52, "LAST", COLOR_MUTED, COLOR_BG);
        fb_draw_text(42, 52, line, COLOR_TEXT, COLOR_BG);
    }
    mode_hint();
}

static void render_conf(const provisioning_lcd_status_t *prov)
{
    char line[32];
    fb_clear(COLOR_BG);
    fb_fill_rect(0, 0, BOARD_LCD_H_RES, 12, COLOR_PANEL);
    fb_draw_text(2, 2, "SETUP", COLOR_ACCENT, COLOR_PANEL);

    const char *link = "SETUP AP";
    uint16_t lc = COLOR_WARN;
    if (prov->phase == PROV_PHASE_SCANNING) link = "SCANNING";
    else if (prov->phase == PROV_PHASE_TESTING) link = "TESTING";
    else if (prov->phase == PROV_PHASE_SUCCESS) { link = "SAVED"; lc = COLOR_OK; }

    fb_draw_text(2, 16, "LINK", COLOR_MUTED, COLOR_BG);
    fb_draw_text(42, 16, link, lc, COLOR_BG);
    fb_draw_text(2, 28, "AP", COLOR_MUTED, COLOR_BG);
    snprintf(line, sizeof(line), "%.17s", PROV_SOFTAP_SSID);
    fb_draw_text(26, 28, line, COLOR_TEXT, COLOR_BG);
    fb_draw_text(2, 40, "URL", COLOR_MUTED, COLOR_BG);
    snprintf(line, sizeof(line), "%d.%d.%d.%d",
             PROV_SOFTAP_IP_A, PROV_SOFTAP_IP_B, PROV_SOFTAP_IP_C, PROV_SOFTAP_IP_D);
    fb_draw_text(42, 40, line, COLOR_ACCENT, COLOR_BG);
    fb_draw_text(2, 52, "NET", COLOR_MUTED, COLOR_BG);
    snprintf(line, sizeof(line), "%d found", prov->scan_count);
    fb_draw_text(42, 52, line, COLOR_TEXT, COLOR_BG);
}

static void render_overlay(void)
{
    char line[24];
    fb_clear(COLOR_BG);
    fb_fill_rect(0, 0, BOARD_LCD_H_RES, 12, COLOR_PANEL);
    fb_draw_text(2, 2, "T-DONGLE", COLOR_ACCENT, COLOR_PANEL);

    if (s_overlay == DISPLAY_OVERLAY_RESET_DONE) {
        fb_draw_text(20, 28, "SETTINGS", COLOR_OK, COLOR_BG);
        fb_draw_text(20, 44, "CLEARED", COLOR_OK, COLOR_BG);
    } else if (s_overlay == DISPLAY_OVERLAY_MODE_APPLIED) {
        fb_draw_text(2, 24, s_msg1, COLOR_ACCENT, COLOR_BG);
        fb_draw_text(2, 40, s_msg2, COLOR_TEXT, COLOR_BG);
        fb_draw_text(2, 60, "rebooting...", COLOR_MUTED, COLOR_BG);
    } else { /* RESET_CONFIRM */
        fb_draw_text(30, 18, "RESET ALL?", COLOR_WARN, COLOR_BG);
        fb_draw_text(4, 34, "Press again in", COLOR_TEXT, COLOR_BG);
        snprintf(line, sizeof(line), "%ds to confirm", s_overlay_seconds);
        fb_draw_text(20, 48, line, COLOR_ACCENT, COLOR_BG);
    }
}

static void draw_hold_bar(void)
{
    if (!s_hold_active) return;
    if (s_hold_hint[0]) {
        /* Clear the hint row then draw it just above the bar. */
        fb_fill_rect(0, BOARD_LCD_V_RES - 18, BOARD_LCD_H_RES, 10, COLOR_BG);
        fb_draw_text(2, BOARD_LCD_V_RES - 17, s_hold_hint,
                     s_hold_reset_zone ? COLOR_ERR : COLOR_ACCENT, COLOR_BG);
    }
    int w = (BOARD_LCD_H_RES - 4) * s_hold_pct / 100;
    if (w < 0) w = 0;
    if (w > BOARD_LCD_H_RES - 4) w = BOARD_LCD_H_RES - 4;
    fb_fill_rect(2, BOARD_LCD_V_RES - 6, BOARD_LCD_H_RES - 4, 4, COLOR_PANEL);
    fb_fill_rect(2, BOARD_LCD_V_RES - 6, w, 4, s_hold_reset_zone ? COLOR_ERR : COLOR_WARN);
}

