93percentai/esp32-ethernetviawifi/firmware/main/display.c
static void display_task(void *arg)
{
    (void)arg;
    while (true) {
        render();
        vTaskDelay(pdMS_TO_TICKS((s_overlay != DISPLAY_OVERLAY_NONE || s_hold_active) ? 120 : 500));
    }
}

esp_err_t display_init(void)
{
    ESP_LOGI(TAG, "Init ST7735 %dx%d", BOARD_LCD_H_RES, BOARD_LCD_V_RES);

    spi_bus_config_t buscfg = ST7735_PANEL_BUS_SPI_CONFIG(
        BOARD_LCD_PIN_SCLK, BOARD_LCD_PIN_MOSI,
        BOARD_LCD_H_RES * BOARD_LCD_V_RES * sizeof(uint16_t));
    ESP_ERROR_CHECK(spi_bus_initialize(BOARD_LCD_SPI_HOST, &buscfg, SPI_DMA_CH_AUTO));

    esp_lcd_panel_io_handle_t io = NULL;
    esp_lcd_panel_io_spi_config_t io_config =
        ST7735_PANEL_IO_SPI_CONFIG(BOARD_LCD_PIN_CS, BOARD_LCD_PIN_DC, NULL, NULL);
    ESP_ERROR_CHECK(esp_lcd_new_panel_io_spi((esp_lcd_spi_bus_handle_t)BOARD_LCD_SPI_HOST,
                                             &io_config, &io));

    esp_lcd_panel_dev_config_t panel_config = {
        .reset_gpio_num = BOARD_LCD_PIN_RST,
#if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)
        .rgb_ele_order = LCD_RGB_ELEMENT_ORDER_BGR,
#else
        .color_space = ESP_LCD_COLOR_SPACE_BGR,
#endif
        .bits_per_pixel = 16,
    };
    ESP_ERROR_CHECK(esp_lcd_new_panel_st7735(io, &panel_config, &s_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_reset(s_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_init(s_panel));
    ESP_ERROR_CHECK(esp_lcd_panel_invert_color(s_panel, true));
    esp_lcd_panel_set_gap(s_panel, BOARD_LCD_GAP_X, BOARD_LCD_GAP_Y);
    esp_lcd_panel_swap_xy(s_panel, true);
    ESP_ERROR_CHECK(esp_lcd_panel_mirror(s_panel, false, true));
    ESP_ERROR_CHECK(esp_lcd_panel_disp_on_off(s_panel, true));

    gpio_config_t bl_conf = {
        .pin_bit_mask = 1ULL << BOARD_LCD_PIN_BL,
        .mode = GPIO_MODE_OUTPUT,
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&bl_conf));
    ESP_ERROR_CHECK(gpio_set_level(BOARD_LCD_PIN_BL, BOARD_LCD_BL_ON_LEVEL));

    fb_clear(COLOR_BG);
    fb_draw_text(24, 36, "BOOTING...", COLOR_ACCENT, COLOR_BG);
    esp_lcd_panel_draw_bitmap(s_panel, 0, 0, BOARD_LCD_H_RES, BOARD_LCD_V_RES, s_fb);
    ESP_LOGI(TAG, "ST7735 ready");
    return ESP_OK;
}

void display_task_start(void)
{
    xTaskCreatePinnedToCore(display_task, "lcd", 4096, NULL, 2, NULL, 1);
}

#else /* !CONFIG_BRIDGE_LCD_ENABLED */

esp_err_t display_init(void) { return ESP_OK; }
void display_task_start(void) {}
void display_set_overlay(display_overlay_t kind, int seconds_left) { (void)kind; (void)seconds_left; }
void display_set_message(const char *l1, const char *l2) { (void)l1; (void)l2; }
void display_next_screen(void) {}
display_screen_t display_current_screen(void) { return SCREEN_OVERVIEW; }
void display_set_hold(bool active, int pct, bool reset_zone) { (void)active; (void)pct; (void)reset_zone; }
void display_set_hold_hint(const char *hint) { (void)hint; }
void display_get_snapshot(display_snapshot_t *out)
{
    if (!out) {
        return;
    }
    memset(out, 0, sizeof(*out));
    strncpy(out->title, "LCD off", sizeof(out->title) - 1);
    strncpy(out->lines[0], "(display disabled)", DISPLAY_SNAP_WIDTH - 1);
    out->line_count = 1;
}

#endif
